<?php
if ( ! defined( 'ABSPATH' ) ) {
    exit;
}
// محتوای آموزشی
function jay_login_register_instructions_page_html() {
    if ( ! current_user_can( 'jay_login_register_manage_settings' ) ) {
        return;
    }

    ?>

    
    <div class="wrap">
<h1>
 <?php esc_html_e( 'راهنمای افزونه JAY Login & Register', 'jay-login-register' ); ?>
</h1>

        <div class="jay-login-register-cards-container">
            <div class="card">
                <h2 class="title">معرفی افزونه</h2>
<p>
     پس از نصب افزونه در بالای صفحه مطابق عکس به شما پیغامی میدهد که برگه های موجود افزونه را نصب کنید خودش به صورت داینامیک برگه ها را میسازه و شورت کد های فرم اصلی و پروفایل را درونش ذخیره میکنه
     
</p>
<p>
<img src="<?php echo esc_url( JAY_LOGIN_REGISTER_URL . 'assets/images/1-1.jpg' ); ?>">
</p>
<p>
    پس از نصب افزونه از منوی کنار کاربری در wp-admin میتوانید وارد تنظیمات افزونه شوید یا در قسمت افزونه ها در کنار افزونه گزینه تنظیمات را کلیک کنید
</p>

<p>
    در منوی تنظیمات شما میتوانید کارهای زیادی انجام دهید که گام به گام به شما گفته خواهد شد
</p>
<p>
    قبل از مراحل بگم که این سیستم کاملا سازگار با دیجیتس است یعنی کاربران قبلی شما که با دیجیتس ورود یا عضو شدند به راحتی با این سیستم هم میتوانند ورود کنند و سیستم آنها را به عنوان کاربر شما شناسایی میکند و لازم به ساختن یوزر جدیدی نیست . پس نگران این قسمت نباشید.
</p>
<p>
<strong>مهم : </strong> 
افزونه دارای شورت کد است،شما به راحتی میتوانید در هرجا دوست دارید فراخوانی کنید یا مودال باشد.و همچنین دارای ریدایرکت هوشمند است که در ادامه به طور کامل آموزش داده میشود.
</p>
<p>
<strong>نکته :</strong>
 اگر بعد از مدتی باز خواستید به هر نحوی از دیجیتس استفاده کنید کاربرانی که با سیستم ما عضو شدند باز هم میتوانند با دیجیتس وارد شوند و همگام سازی دوسو نیز میباشد و نگران کاربرانی که با سیستم ما یا دیجیتس عضو شدند نباشید
</p>
<p>
   <strong> توجه : </strong>
سیستم به صورت هوشمند میفهمد که کاربر جدید و عضو نیست میرود به سمت عضویت ،کاربر عضو شده و قدیمی است و به سمت مسیر ورود میرود.
</p>
<p>
    این افزونه دو ستون به قسمت کاربران سایت وردپرس شما می افزاید. ستون های تاریخ عضویت و شماره همراه کاربر که از قسمت مدیریت دسترسی میتوانید آنها را هم مخفی کنید یا هر ستونی که دوست دارید اضافه کنید
</p>
<p>
  <strong>  مرحله اول (تنظیمات پنل پیامک)</strong>
تنظیمات پنل پیامکی است که شما باید سرویس دهنده یا نمایندگی اون مکانی که به شما سرویس پیامک را میدهد اطلاعاتش را وارد کنید.آموزش اینکه api یا کد پترن یا چه شماره ای را وارد کنید از سرویس دهندتون بپرسید و یا تیکت بزنید بهتون پاسخ میدهند که از کجا پترن درست کنید و یا کلید API  را درست کنید
بعد از تنظیمات حتما هر قسمت را ذخیره کنید و روی دکمه ذخیره تنظیمات کلیک فرمایید
</p>
<p>
    کاوه نگار،ملی پیامک،تابان اس ام اس،مدیرپیامک،فرازاس ام اس،رایگان اس ام اس،sms.ir,ippanel
</p>
<p>
      <strong>مرحله دوم (تنظیمات عمومی)  </strong>
    <ul>
<li><strong>&nbsp;تعداد ارقام کد تایید :</strong> در اینجا تعریف میکنید که موقع کد تایید که پیامک میشه یا ایمیل میشه چه تعداد رقمی باشد</li>
<li>اعتبار کد تایید (دقیقه) : چند دقیقه اون کدی که برای کاربر فرستاده شده است معتبر است و بعد از اتمام زمان مشخص میتواند ارسال مجدد کد کند</li>
<li><strong>حداکثر تلاش برای کد تایید :</strong> چند بار میتواند کدی که براش فرستاده شده است امتحان کند،و بعد از این تعداد کد اشتباه وارد کند کاربر مسدود میشود.این قسمت بیشتر برای ربات ها تعریف شده است که در این مرحله به دام بیفتند.و درخواست های پیاپی ندن تا شارژ پنل پیامکی شما هدر نرود</li>
<li><strong>مدت زمان مسدودیت (دقیقه) :</strong> چه مدت بعد از اینکه کد هارا امتحان کرد مسدود باشد و بعد از چند دقیقه دوباره اقدام به ارسال مجدد کد کند</li>
<li><strong>روش مسدودسازی :</strong> برچه اساسی کاربر را مسدود میکنید آیا فقط همون شماره ای که وارد شده است را مسدود میکنید یعنی کاربر یا ربات با شماره های دیگه میتواند ارسال کد کند یا IP کاربر یا ربات را مسدود کرده اید.اگر هردو را فعال کنید بهتر است که ربات یا کاربر به مدتی که تعریف کردید نتواند اقدام به دریافت کد کند</li>
<li><strong>روش‌های احراز هویت :</strong> در این قسمت شما میتوانید احراز هویت کاربرانتون را در ورود یا عضویت انجام دهید میتوانید با کد ملی یا گذرنامه یا هر دو این کار را انجام دهید.نکته جالب این قضیه کاربر پس از تعیین تکلیف در مرحله اول که حسابش بررسی میشه برای ورود یا عضویت به سراغ این قسمت میاد که مشخص کنه کد ملی خود را و بعد از وارد کردن کدملی کد تایید ارسال میشود و این هم میتواند گزینه خوبی برای جلوگیری از ربات ها باشند تا در این تله ما هم گیر کنند.چون کد ملی اگر از قبل در سایت شما عضو باشد سیستم ارور میده و بهش میگه این کد ملی متعلق به شماره دیگری است و توسط شخص دیگری ثبت شده است. و همچنین کد ملی براساس قوانین ایران نوشته شده است و هر عددی نمیتواند وارد کند باید حتما کد ملی واقعی را نیز وارد کند در غیر این صورت بهش ارور داده میشه که کد ملی معتبر وارد کنید. و در قسمت ورود سیستم خودش میفهمد اگر کاربر متاکی codemeli را داشته باشد دیگر در قسمت ورود از او درخواست نمیشه و فقط در قسمت ثبت نام است که در خواست میشه و در قسمت ورود سریعا با شماره و کد یا پسورد وارد سایت شما میشه.تا مزاحمتی دو چندان برای کاربری نداشته باشه. نکته جالب اینه که اگر کاربری عضو است و میخواد ورود کنه اما کد ملی نداشته فقط در اولین نوبت ازش میپرسه و در دفعات بعد برای ورود دیگر از کاربر درخواست نمیکنه</li>
<li><strong>روش‌های ورود/عضویت مجاز :</strong> کاربر در سه حالت میتواند ورود / عضو در سایت شما شود.با ایمیل با شماره با نام کاربری،نام کاربری در قسمت تب فیلدهای دلخواه تعبیه شده است که اگر تیک آنرا بزنید کاربر میتواند با نام کاربری خود ورود یا عضو شود.و تمامی استاندارد ها برای نام کاربری تعبیه شده است. نکته جالب برای نام کاربری اگر کاربر با نام کاربری بخواد ورود کنه شما اگر شماره و ایمیل و بله را فعال کرده باشید بهش درخواست داده میشه که کد به کدوم یک فرستاده شود.برای موبایل و ایمیل هم که نیاز به توضیحی نیست سیستم موبایل که در تنظیمات پنل پیامکی است و ارسال کد به ایمیل در تب تنظیمات ایمیل میباشد و نیاز به افزونه جانبی نیست به راحتی با فعال کردن آن قسمت کد به ایمیل کاربر بدون مشکل فرستاده میشود فقط کافیه ایمیل هاست خود را فعال کنید.</li>
<li><strong>برگه ورود/عضویت :</strong> برگه ای که شورت کد افزونه در آن قرار دارد شورت کد قابل استفاده افزونه را میتوانید از زیر منوی آموزش بردارید یا همینجا [ jay_login_register_form ] .بله شما هم میتوایند از برگه که خود سیستم ساخته هم با شورت کد در هرجا که لازمه فراخوانی کنید فرم را میتوانید با المنتور آنرا مودال کنید و هرکاری دوست دارید باهاش انجام بدهید</li>
<li><strong>هدایت پس از ورود/عضویت :</strong> این قسمت که کاربر بعد از ورود / عضویت به کدام برگه شما برود میتوانید برگه پنل کاربری خود را بروی این قسمت تنظیم کنید</li>
<li><strong>برگه پروفایل کاربری :</strong> میتوانید از شورت کد حرفه ای و پنل کاربری سیستم ما استفاده کنید یا از سیستم مخصوص خودتون فقط کافی است که برگه مربوطه را در اینجا مشخص کنید</li>
<li><strong>برگه خروج : </strong>
که از برگه هایی که سیستم ساخته باید حتما استفاده کنید تا کاربر با کلیک بروی اون از سیستم شما خارج شود yoursite.com/logout از این url میتوانید در هرجای دیگر سایتتون هم استفاده کنید و کاربر با کلیک بروی آن بلافاصله از سیستم خارج میشود</li>
</ul>
</p>
<p><strong>مرحله سوم (فیلد های دلخواه )</strong></p>
<ul>
<li><strong>دریافت نام کاربری (ورود/عضویت) :</strong> در این قسمت تیک نام کاربری را میزنید که کاربر در موقع عضویت نام کاربری دلخواه خودش را وارد کند و از قسمت ورود هم بتواند با نام کاربری ورود کند.</li>
<li><strong>دریافت نام و نام خانوادگی :</strong> این قسمت در موقع ثبت نام قبل از اینکه ثبت نام کاربر انجام شود و تکمیل شود از کاربر گرفته خواهد شد.</li>
<li><strong>فیلدهای سفارشی :</strong> این قسمت بسیار بزرگ و فرم ساز قوی برخوردار است شما میتوانید فرم های مختلف در هنگام عضویت بسازید و مشخصات را از کاربر بگیرید این اطلاعات در یوزرمتای کاربر ذخیره میشود و هر اطلاعاتی که میخواهید از نوع (چک باکس،رادیو باتوم،پاراگراف،تاریخ شمسی با تقویم شمسی،تاریخ میلادی با تقویم میلادی،لیست بازشو و متن تکی، شماره که در این قسمت میتوانید تعداد شماره را تعریف و قوانین را تعریف کنید که این شماره با چه اعدادی شروع شوند). برای فیلد ها میتوانید توضیحاتی بنویسید و در زیر فیلد ظاهر می شود و همچنین ضروری یا غیر ضروری بودن فیلد ها را میتوانید برای کاربر تعیین کنید.</li>
</ul>
<p><strong>مرحله چهارم (استایل)</strong></p>
<ul>
<li><strong> آپلود لوگو :</strong> لوگویی که میخواهید در فرم ورود/عضویت نمایش دهید را آپلود می کنید.</li>
<li><strong>استایل فیلد کد تایید (OTP) :</strong> اینجا میتوانید تعریف کنید که تک فیلد باشد یا براساس تعداد کد به صورت تک تک فیلد (فیلدهای تک کاراکتری)داشته باشد و در این قسمت کاربر به محض اینکه کد ها را وارد کند دکمه خودش لود میشود و نیاز به تایید کد نیست. یا کلیک اضافه از سمت کاربر نیست</li>
<li><strong>قالب‌های فرم :</strong> در حال حاظر یک قالب است اما در آینده قالب های بسیار دیگری بهش اضافه میشود ولی همین قالب را هم می توانید ویرایش کنید بروی دکمه ویرایش کلیک کنید و به تنظیماتش بروید و هر قسمت از قالب فرم را میخواهید از بک گراند تا هاشور ها و بردرها را رنگ و ابعادش را تغییر دهید. با این ویرایش میتوانید فرم های زیادی براساس رنگ بندی برندتون به راحتی درست و تنظیم کنید. همچنین شما میتوانید از css3 در ترکیب رنگ هاتون استفاده کنید به عنوان مثال : linear-gradient(135deg, #667eea, #764ba2, #f093fb) یا 1px solid rgba(255, 255, 255, 0.2) یا rgba(255, 255, 255, 0.1) به همین راحتی برای رنگ بندی های حرفه ای دست شما باز است.</li>
</ul>
<p><strong>مرحله پنجم (تنظیمات کپچا)</strong></p>
<ul>
<li><strong>کپچای ریاضی</strong> : <span class="description jay-login-register-description-note">یک سوال ریاضی که یکی از (ضرب / تقسیم/منها/جمع) به فرم اضافه می‌کند که جلوی ربات‌ها را می‌گیرد.</span></li>
<li><strong> کپچای داخلی نامرئی (Honeypot):</strong> یک روش امنیتی نامرئی برای به تله انداختن ربات‌ها بدون ایجاد مزاحمت برای کاربر.(این کپچا دو مرحله ای است.اگر تله را ربات پر نکند مرحله بعدی زمان پر کردن فیلد را محاسبه میکند.که به طبع ربات ها اینکار را سریع انجام میدهند و باز هم در تله ما گیر می افتند )</li>
<li><strong> Google reCAPTCHA v3 (بسیار امن – پیشنهادی):</strong>کپچای نامرئی گوگل که بدون ایجاد مزاحمت برای کاربر، ربات‌ها را شناسایی می‌کند.برای استفاده از reCAPTCHA v3، باید کلیدهای سایت خود را از گوگل دریافت کنید.ما لینک دریافت کلید از گوگل و همچنین آموزش دریافت را براتون در همونجا گفتیم.</li>
</ul>
<p><strong>مرحله ششم (تنظیمات شبکه‌های اجتماعی)</strong></p>
<ul>
<li>&nbsp;در حال حاظر ۳ شبکه موجود است که در آینده نزدیگ واتساپ و تلگرام و غیره بهش افزوده خواهد شد</li>
<li><strong>ورود / عضویت با ایتا :</strong> شما اول باید در ایتایار عضو بشوید و برنامک خودتان را بسازید و توکنی که از اونجا به شما میده در برنامه ست کنید .کاربرها را از این به بعد بهشون لینک ایتا را بدهید بدون اینکه کاری با سایت شما داشته باشند احراز هویت میشوند اگر عضو بوده باشد ورود و اگر عضو نباشد عضوش میکند به همین راحتی بدون اینکه بروی چیزی کلیک کنند.</li>
<li><strong>ورود با گوگل :</strong> که در همه جا مشاهده کردید در خیلی از سایت ها که آیکون گوگل است و شما با اکانت گوگل خود وارد یا عضو سایتی میشوید در اینجا هم به راحتی کاربران میتوانید وارد یا عضو سایتتون شوند.در این قسمت هم داخل پنل مربوطه آموزش های ساخت اکانت و دستیابی به کلید ها را آموزش دادیم لازم نیست جای دوری بروید و کلی دنبال آموزشش بگردید.</li>
<li><strong>بله :</strong> این قسمت کد تایید از سمت بله است یعنی پس از فعال کردن بله در قسمت عضویت یا ورود اگر فعال کرده باشید دکمه کد تایید به بله فعال است و کاربر میتونه انتخاب کنه کد تایید به ایمیل یا شماره یا بله باشد که از هزینه های شما کمی کمتر کند</li>
</ul>
<p><strong>مرحله هفتم (تنظیمات ایمیل)</strong></p>
<p>این تب یک سیستم smtp برای ارسال ایمیل های شما است. اگر افزونه ای برای ارسال ایمیل ها نصب دارید گزینه اول را انتخاب کنید در غیر اینصورت گزینه دوم را انتخاب کنید.افزونه های سنگین برای اینکار نیاز نیست چون گزینه دوم ما علاوه بر اینکه کد تایید را به ایمیل کاربرها میفرسته کل افزونه ها و وردپرس شما که نیاز به ارسال ایمیل است را هندل میکند و بی نیاز از افزونه جانبی برای ارسال ایمیل هستید.تمامی افزونه ها را پشتیبانی میکند تمامی ایمیل های شما ارسال میشود.مثل گراویتی فرمز ،ووکامرس و غیره.فقط کافیه در هاست خودتون یک ایمیل بسازید و اطلاعات ایمیل خود را وارد کنید و همچنین اطلاعات ایمیل هاست را هم تیکت به پشتیبانی بزنید تا در اختیار شما قرار دهند.<br>
اگر پنل ایمیل خریداری کرده اید اطلاعات آن پنل را وارد کنید ست میشود<br>
همچنین قسمت قدرتمند ایمیل ما ، شما میتوانید برای کدهایی که ارسال میشود قالب اختصاصی خود را طراحی کنید تا با استاندارد های برند خودتون کد تایید به کاربران ارسال شود این قالب فقط مخصوص ارسال کد از سمت افزونه ما است برای ارسال ایمیل دیگر افزونه ها براساس تنظیمات خوده اون افزونه ایمیل ارسال میشود.شما فقط با گزینه دوم بی نیاز از هر افزونه سنگین برای ارسال ایمیل میشوید.</p>
<p><strong>مرحله هشتم (کنترل دسترسی)</strong></p>
<p>این منو دارای سه تب است</p>
<ul>
<li>&nbsp;<strong>دسترسی به پیشخوان :</strong> در این قسمت برای امنیت بیشتر سایتتون میتوانید دسترسی به wp-login.php را ببندید و آن را مخفی کنید و دیگر کاربران نمیتوانند به این بخش دسترسی داشته باشند.و همچنین میتوانید تعیین کنید چه نقش هایی میتوانند به قسمت پیشخوان وردپرس یعنی wp-admin دسترسی داشته باشند و چه نقش هایی دسترسی نداشته باشند</li>
<li><strong>تب مدیریت ستون های کاربران :</strong> در این قسمت میتوانید ستون های قسمت کاربران در وردپرس را معلوم کنید که کدام قسمت ها نمایش داده شوند و کدام قسمت ها نمایش داده نشود. در ضمن دو ستون به لیست کاربران تاریخ عضویت و شماره همراه اضافه می کند که از این قسمت میتوانید آنها را مخفی کنید</li>
<li><strong>ستون های سفارشی :</strong> شما میتوانید ستون های سفارشی خودتون را در لیست کاربران اضافه کنید و میتوانید تعیین کنید که یا مقدارش را نمایش دهد یا تیک داشته باشد . ستون های سفارشی از طریق متاکی در تیبل یوزرمتای کاربر رهگیری می شود نمونه را در عکس گذاشتیم</li>
</ul>
<p><strong>مرحله نهم (پنل کاربری)</strong></p>
<ul>
<li><strong>متاکی (شناسه) آواتار :</strong> در این قسمت متاکی که میخواد عکس های کاربر آپلود شود مشخص میکنید و دیگر نباید تغییرش دهید چون عکس های کاربران قبلی که آپلود کردن از بین میرود.در این قسمت دیگر شما ادمین یا کاربر لازم نیست در سایت گراواتار یا جایی عضو شوند ادمین هم کاری لازم نیست انجام دهد.کاربر به محض اینکه عکس خود را آپلود کند در سراسر وردپرس و هر افزونه ای دیگری که آواتار را براساس گراواتار نمایش میدهد یکسان سازی شده و نمایش در همه پنل ها میدهد از جمله ووکامرس و هر افزونه ی دیگری که برای آواتار یا عکس کاربر نیاز به گراواتار داشته باشد.همونطور که در عکسها نمایش دادیم در همه جای وردپرس و افزونه ها یکسان سازی میشه.</li>
<li>ویرایش مشخصات : در این قسمت شما میتوانید اطلاعاتی را برای پروفایل از کاربر درخواست کنید که چه اطلاعاتی را در سایت وارد کند</li>
<li><strong><label for="profile_custom_fields_json">فیلدهای دلخواه پروفایل</label> :</strong> این قسمت یک فرم ساز قدرتمند است که شما به راحتی با <strong>درگ و دراپ</strong> میتوانید فیلد ها را جابه جا کنید و همچنین تنظیمات پیشرفته میتوانید شرط هایی را تعریف کنید که در عکس ها گفته شده.یک شرطی که هست و در هیچ جا پیدا نمیکنید <strong>شرط گذاری براساس متاکی</strong> است که اگر کاربری اون شرط را داشت اون فیلد را نمایش دهد اگر نداشت نمایش ندهد شما میتوانید به راحتی برای هر کاربری یک پنل کاربری خاصی بسازید و اطلاعات مخصوص خودش را ازش بگیرید و هر کاربر اطلاعات مخصوص خودش را ببیند و پر کند. پنل کاربری دارای هوک قوی برای توسعه دهندگان هم است که پس از ذخیره چه کارهایی انجام دهد و میتوانید در فانکشن قالب خود ازش استفاده کنید</li>
<li><strong>دکمه رفتن به حساب های کاربری</strong> : بدون نیاز به یوزر و پسورد که حساب کاربراتون را بتوانید چک کنید</li>
<li><strong>دسترسی ویرایش :</strong> شما میتوانید بگید چه کاربرانی میتوانند پروفایل خود را ویرایش کنند و چه کاربرانی خیر.این در زمانی است که یک سیستم اطلاعات کاربر را ذخیره میکند و دیگر دوست ندارد تغییراتی اعمال شود مگر با گزارش به مدیریت تا تغییرات اعمال شود و لیست کاربران شما بهم ریختگی در خروجی نداشته باشد</li>
<li><strong>لیست کاربرانی که مجوز ویرایش دارند و ندارند را مشخص کردیم</strong></li>
</ul>
<p><strong>مرحله دهم (قفل محتوا)</strong></p>
<p>قفل محتوا به دو صورت است یک اینکه شما کل صفحه را برای کاربر ببندید یا فقط قسمتی از محتوای خود را میخواهید قفل باشد تا ورود / عضو باشد کاربر ،که این قفل محتوا ها هم با همه جا فرق های بسیاری دارد و شما در هیچ کجا اصلا پیدا نمیکنید</p>
<p><strong>قفل محتوای کل محتوا</strong></p>
<p>این تنظیمات در زیر کانتنت یا گوتنبرگ شما در قسمت برگه ها و نوشته ها و همچنین ووکامرس یا هر جایی که به نوشته مرتبط باشد نمایش داده میشود بعضی از افزونه هایی که دارای پست تایپ هستند سازگار است.و به راحتی اونها را هم میتوانید قفل کنید</p>
<p><strong>ریدایرکت هوشمند</strong></p>
<p>برای اینکه ریدایرکت اعمال شود شما باید به برگه یا نوشته مربوط بروید و تیک <strong>برای مشاهده این محتوا نیاز به ورود است؟&nbsp;</strong>را بزنید. سیستم خودش تشخیص میده کاربر را به برگه فرم ورود/عضویت که تعریف کردید و شورت کد ما داخلش است میبرد و پس از تعیین تکلیف در اونجا از دوباره به همان صفحه ای که آمده است بازگردانده میشود تا مسیر خود را گم نکند و تجربه کاربری بهتری داشته باشد.لازم به ذکر است برای همه افزونه هایی که پنل ورود / عضویت دارند<strong> مثل ووکامرس،دکان و …</strong> اینکار قابل انجام است و محدودیتی برای افزونه خاصی ندارد و با همه افزونه های موجود سازگار است . یعنی شما صفحه <strong>my-accuont ووکامرس</strong> را میخواهید دیگر اون فرم ووکامرس نباشد تیک ورود را میزنید کاربر در این صفحه وارد میشود بدون اینکه متوجه شود به صفحه ورود میرود و در آنجا کارهایش را انجام میدهد چه ورود چه عضو میشود و از دوباره وارد شده به صفحه مدیریت ووکامرس برمیگردد و دیگر اون صفحه ورود و عضویت ووکامرس را نخواهد دید شما به راحتی میتوانید برای همه برگه ها که میخواهید از فرم ما استفاده کند باید حتما تیک ورود را بزنید.مثلا <strong>صفحه پرداخت</strong> هم میخواهید اول بره عضو بشه یا ورود کنه بعد پرداخت کنه اونم تیک را میزنید و از دوباره با اطلاعاتش به صفحه پرداخت هدایت میشود بدون اینکه اذیتی بشود</p>
<p><strong>روش های محافظت&nbsp;</strong></p>
<p>سه مدل است :</p>
<p>۱- هیچکدام یعنی فقط کاربر وارد بشود اگر تیک را زدید و به بقیش کاری ندارید</p>
<p>۲ – مسدود کردن کل صفحه : در این قسمت کل صفحه کاربر مسدود میشود و پیغام مخصوص شما را که در باکس های زیر تعریف کردید به شما نمایش میدهد. در این روش کل سایت را قفل میکند و سایدبار یا منوهای شما را دیگر نمایش نمیدهد</p>
<p>۳-قفل کل محتوا با تفاوت از قبلی اینکه به قالب شما کاری ندارد و کل محتوا را فقط قفل میکند و منو ها و سایدبار ها و فتور و هدر را نمایش میدهد و فقط کل محتوا را قفل میکند</p>
<p><strong>روش های محدودیت</strong></p>
<p><strong>محدودیت براساس متاکی</strong></p>
<p>در این روش شما میتوانید براساس متاکی محتوا را از ۲ روش بالا ببندید یعنی بگید کاربری که این متاکی را نداشت نمیتواند این محتوا را ببیند و فقط کاربران مخصوصی که متاکی را دارند ببیند.این روش زمانی به درد شما میخورد که کاربران با خرید پکیج های شما از سایت است که پس از خرید از سایت بتواند این صفحه را ببیند</p>
<p>شما میتوانید برای <strong>قفل خود تیتر،توضیحات و دکمه ای که به اون برگه هدایت</strong> شود و متن دکمه را هم مشخص کنید</p>
<p>در روش بعدی هم قفل براساس نقش کاربری است که در بالا توضیحات داده شده و فرقی نمیکند الابته با این تفاوت در قفل براساس نقش پیغام را نمیتوانید تغییر دهید و به صورت دیفالت میباشد</p>
<p><strong>نکته :</strong> شما میتوانید هر دورا فعال همزمان داشته باشید یعنی هم متاکی هم نقش کاربری چون گاهی ممکنه کاربری اون نقش را داشته باشد اما اون متاکی را نه و یا برعکس پس میتوانید بستگی به استراتژی شما دارد تا بتوانید محتوا را چطوری قفل کنید.</p>
<p><strong>روش محافظت دوم&nbsp;</strong></p>
<p>در این روش شما میخواهید فقط بخشی از محتوای خود را قفل کنید که در ویرایشگر کلاسیک در بالای صفحه مشاهده میکنید و در <strong>گوتنبرگ کافیه در قسمت بلوک ها کلمه قفل محتوا</strong> را جستجو کنید و به عنوان بلوک ازش استفاده کنید و هرچی که داخل اون بلوک باشد قفل میشود</p>
<p><strong>نکته :</strong> شما در یک صفحه میتوانید از قفل های مختلفی استفاده کنید و محدودیتی در این زمینه ندارید</p>
<p>این قفل محتوا هم در تمامی افزونه هایی که قابلیت نوشتن داشته باشد عمل میکند در افزونه هایی مثل ووکامرس و غیره سازگاری با هر افزونه ای که قابلیت نوشتن به شما بدهد سازگار است.</p>
<p>حالا حالت های این قسمت که خیلی متفاوت تر از افزونه های دیگری است<br>
<strong>دارای ۲ حالت مختلف یکی ریدایرکت یکی اینلاین ریدایرکت</strong></p>
<p><strong>در حالت هدایت به صفحه ورود</strong></p>
<p><strong>شما میتوانید تیتر و توضیحات و رنگ دکمه و متن دکمه قفل شده را مشخص کنید .&nbsp;</strong></p>
<p>کارایی این چی است کاربری که روی دکمه کلیک میکند به فرم ورود / عضویت میرود اونجا تعیین تکلیف برایش انجام میشود و به به صفحه ای که قفل بوده و به مطلبی که قفل بوده بازگشته و سروت میشود.حال در قسمتی <strong>انتقال به آدرس دیگر</strong> است نمیخواهید به این صفحه بازگردد و به صفحه ای دیگر برود کافی است لینک اون آدرس را بزارید و پس از تعیین تکلیف به اون صفحه که مشخص کرده ای میرود</p>
<p>قسمت دوم و جذاب دیگر که ورود / عضویت درون خطی است یعنی کاربر را به هیچ جا نمیبریم در همان صفحه اطلاعات خود را وارد میکند و تعیین تکلیف برای ورود / عضویت براش انجام میشود .تمامی امکاناتی که در تنظیمات اصلی افزونه تعریف کردید در اینجا اعمال میشود اعم از کپجا ، نحوه ورود / عضویت ،زمان های مسدودیت و … همه آنها در اینجا انجام میشود</p>
<p><strong>در این قسمت میتوانید بگویید فقط دکمه نمایش داده شود</strong></p>
<p>قسمتی هیجان انگیز این قسمت فرم ساز قوی که برای این قسمت در نظر گرفتیم دقیقا مثل قسمت پنل کاربری و ثبت نام این قسمت تعبیه شده است و تا زمانی که کاربر این فیلد ها را معلوم نکند به جایی نمیرود و دائم از کاربر میخواهد.یعنی اگر کاربری جنسیت داشته باشد که نمیپرسد اما اگر نداشته باشد تا زمانی که جنسیت خودش را مشخص نکند هیچ اتفاقی نمی افتد</p>
<p>و در آخر شما پس از <strong>ساخت شورت</strong> کد میتوانید آن را <strong>ویرایش کنید</strong> کافی است در <strong>ویرایشگر کلاسیک</strong> کل شورت کد را انتخاب کنید و روی دکمه ویرایش بزنید و در <strong>گوتنبرگ روی آیکون قفل کوچک</strong> بزنید و ویرایش کنید تا نخواد از دوباره تنظیماتی که انجام داده اید دوباره انجام دهید</p>
<p><strong>کلام آخر&nbsp;</strong></p>
<p>این افزونه با این همه امکانات <strong>بسیار بسیار سبک</strong> است. و از نظر <strong>سئو و امنیت</strong> بالا نوشته شده است توجه کنید این افزونه با تمامی امکانات در<strong> مخزن وردپرس</strong> گذاشته شده است. و ناگفته نماند افزونه هایی که در مخزن وردپرس هستند از امنیت بالایی برخوردار است چون وردپرس بعد از هر بروزرسانی افزونه ها از نظر امنیتی بررسی میکند و اگر مشکلی باشد افزونه را میبندد.</p>
<p>این افزونه طوری طراحی شده که <strong>کمترین فشار را به منابع هاست</strong> شما وارد شود تمامی<strong> استایل ها ، اسکریپت ها و فایل های اجرایی زمانی</strong> اجرا میشوند که شورت کد ما در آنجا باشد یا شما آنرا فراخوانی کرده باشید یا سیستم ما نیاز باشد اونجا حضور داشته باشد در غیر اینصورت در هیچ کجای سایت شما خبری از فایل های ما نخواهد بود و فراخوانی نمیشود</p>
<p>ناگفته نماند فایل های اجرایی در <strong>بک اند</strong> این افزونه در کل سایت شما <strong>فراخوانی نمی شود</strong> و اونهایی که نیاز است در قسمت مدیریت فقط فراخوانی شده است و کل سایت شما را درگیر نمیکند</p>
<p>
     <strong>
         ورود/عضویت ووکامرس :
     </strong>
نیاز به شورتکد خاصی نیست فقط کافیه تیک ورود را در برگه های ووکامرس اعمال کنید
 </p>
<p>امیدوارم لذت ببرید</p>
<p>منتظر بروزرسانی های بعدی باشید</p>
<p>یا حق</p>
<p>
    <strong>
    توسعه دهنده 
  </strong><br>
    جلال
    رضایی چاهوکی
    <br>
    <a href="https://instagram.com/jayarsiech">
        JAYARSIECH
    </a></p>
            </div>

            <div class="card">
                <h2 class="title">راهنمای استفاده</h2>
                <p>برای استفاده از قابلیت‌های افزونه، از شورت‌کدها و روش‌های زیر استفاده کنید.</p>
                <hr>
                <h3>۱. شورت‌کد فرم اصلی</h3>
                <p>این شورت‌کد، فرم اصلی ورود و عضویت را نمایش می‌دهد.</p>
                <pre>[jay_login_register_form]</pre>
                <h3>۲. پروفایل کاربری</h3>
                <p>این شورت‌کد به کاربران وارد شده امکانات پروفایل را میدهد.</p>
                <pre>[jay_login_register_user_panel]</pre>
                
                <h3>۳. ساخت لینک خروج سفارشی</h3>
                <p>برای ساخت یک لینک خروج زیبا (مثلاً `yoursite.com/logout`)، ابتدا یک برگه جدید در وردپرس با نامک (slug) `logout` بسازید. محتوای برگه می‌تواند خالی باشد. افزونه به صورت خودکار این آدرس را شناسایی کرده و هر کاربری که به آن مراجعه کند را از سیستم خارج می‌کند.</p>
                
                <h3>۴. محافظت از محتوا</h3>
                <p>برای محافظت از محتوای یک برگه، نیازی به شورت‌کد ندارید. کافی است در صفحه ویرایش آن برگه، از باکس «تنظیمات دسترسی JAY Relog» استفاده کنید.</p>
            </div>
        </div>
    </div>
    <?php
}
